{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-COLLEGE_NAME",
    "2": "I-COLLEGE_NAME",
    "3": "B-COLLEGE_TYPE",
    "4": "I-COLLEGE_TYPE",
    "5": "B-LOCATION",
    "6": "I-LOCATION",
    "7": "B-HOSTEL_AVAILABILITY",
    "8": "I-HOSTEL_AVAILABILITY",
    "9": "B-DEPARTMENT_NAME",
    "10": "I-DEPARTMENT_NAME",
    "11": "B-COURSE_NAME",
    "12": "I-COURSE_NAME",
    "13": "B-FEE",
    "14": "I-FEE",
    "15": "B-RATING",
    "16": "I-RATING",
    "17": "B-ADMISSION_PROCESS",
    "18": "I-ADMISSION_PROCESS",
    "19": "B-CUTOFF_RANK",
    "20": "I-CUTOFF_RANK",
    "21": "B-INTERNSHIP",
    "22": "I-INTERNSHIP",
    "23": "B-SCHOLARSHIP",
    "24": "I-SCHOLARSHIP"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ADMISSION_PROCESS": 17,
    "B-COLLEGE_NAME": 1,
    "B-COLLEGE_TYPE": 3,
    "B-COURSE_NAME": 11,
    "B-CUTOFF_RANK": 19,
    "B-DEPARTMENT_NAME": 9,
    "B-FEE": 13,
    "B-HOSTEL_AVAILABILITY": 7,
    "B-INTERNSHIP": 21,
    "B-LOCATION": 5,
    "B-RATING": 15,
    "B-SCHOLARSHIP": 23,
    "I-ADMISSION_PROCESS": 18,
    "I-COLLEGE_NAME": 2,
    "I-COLLEGE_TYPE": 4,
    "I-COURSE_NAME": 12,
    "I-CUTOFF_RANK": 20,
    "I-DEPARTMENT_NAME": 10,
    "I-FEE": 14,
    "I-HOSTEL_AVAILABILITY": 8,
    "I-INTERNSHIP": 22,
    "I-LOCATION": 6,
    "I-RATING": 16,
    "I-SCHOLARSHIP": 24,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
